[
  {
    "label": "React Js / Next Js Developer",
    "institute": "BizSoft Technologies, Lahore",
    "start": "2022",
    "end": "Present",
    "description": [
      "Next. js Framework: Implemented and enhanced web applications built with Next architecture with the help of server-side rendering. Carried out benefits of static generation and dynamic routing to enhance the application and SEO. Utilized Next. API routes that have to do with js features for constructing efficient and scalable backend services.",
      "Responsive Web Design: Leveraged advanced CSS techniques to implement responsive web designs. Proficiently used the CSS Box Model, styled-components, and CSS preprocessor SASS, incorporating mixins, functions, grid-area concepts, and flexbox to create fluid and adaptive web applications.",
      "State Management Expertise: Effectively managed application state using Middleware, Redux Toolkit, Redux-Saga, Context API, and Redux-Thunk. Ensured seamless data retrieval and storage from the backend, along with executing RESTful services to enhance application functionality.",
      "Team Collaboration: Collaborated closely with cross-functional teams, including designers, product managers, and senior developers, to ensure alignment on project goals and timely delivery. Contributed to code reviews, shared best practices, and provided mentorship to junior developers.",
      "Version Control: Utilized GitHub for version control and project tracking. Established workflows to facilitate collaborative development, maintain code quality, and streamline the deployment process.",
      "Performance Optimization: Conducted performance optimization techniques to improve load times and overall user experience. Implemented lazy loading, code splitting, and caching strategies to enhance application performance.",
      "Component Development: Developed and maintained reusable React components, ensuring consistency across the application and improving development efficiency. Employed modern React patterns and hooks to manage component state and lifecycle."
    ]
  },
  {
    "label": "React Js Developer",
    "institute": "BizSoft Technologies, Lahore",
    "start": "2021",
    "end": "2022",
    "description": [
      "Component Development: Created more than 20 reusable components using styled-components, which improved the possibility of cross-platform and the site’s efficiency. Incorporate maintaining and scalability of the codes that will enhance the efficiency of the development process.",
      "State Management: Implemented Redux for the state management thus guaranteeing effective communication of data within the said application. Used Formik for the form management as it’s dependable and added Axios for the data management as it is comprehensive.",
      "Version Control & Collaboration: Used Git for managing changes, monitoring the project process, and using it in the process of teamwork. Was involved in code reviewing and the code reviewing meetings to ensure that the code standards were high and that the team shared tips.",
      "Responsive Design: Used principles of CSS to make the websites responsive and adaptive in nature. Applied knowledge of CSS Grid and Flexbox in structuring elements that are responsive with an intuitive layout across various devices.",
      "Performance Optimization: Used several optimization measures like Lazy loading & Code splitting to improve site speed & overall User Experience. Concentrated on reducing the amount of loading time and enhancing the general effectiveness of the application.",
      "Problem Solving: Clearly presented good problem solving behavior to ensure that technical issues are easily detected and worked on. Solved problems to provide special approaches for reaching the goals of the project and thus contributing to the success."
    ]
  }
]
